package com.company;
/*
Дано целое число n (0<n<8). Требуется вывести все правильные скобочные последовательности длины 2 n.
В задаче используются только круглые скобки.
2 –> (()) ,
     ()()
3 -> ((())),                       ())(  )(() ((()  ()() ())) (()) ((((   ))))=> 1110  1010 1011  1100 1111 0000
     (()()),
     (())(),
     ()(()),
     ()()()
 */


/*
       n bit
 1000  ()))     8    2^(n-1)      n: 2^(n-1) <  2^n -1
 1001  ())(
 1010  ()()
 1011  ()((
 1100  (())
 1101  (()(
 1110  ((()
 1111  ((((    16-1   2^n -1
10000          16

 */

public class Main9 {
    public static void main(String[] args) {
        for (int i=32; i<=63;i=i+2){
            System.out.println(Integer.toBinaryString(i));
        }

    }
}
